reports/k6/k6-console.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/k6/load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 50 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 328 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  0m01.0s/1m0s

running (0m02.0s), 50/50 VUs, 736 complete and 0 interrupted iterations
default   [   3% ] 50 VUs  0m02.0s/1m0s

running (0m03.0s), 50/50 VUs, 1084 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  0m03.0s/1m0s

running (0m04.0s), 50/50 VUs, 1340 complete and 0 interrupted iterations
default   [   7% ] 50 VUs  0m04.0s/1m0s

running (0m05.0s), 50/50 VUs, 1603 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  0m05.0s/1m0s

running (0m06.0s), 50/50 VUs, 1771 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  0m06.0s/1m0s

running (0m07.0s), 50/50 VUs, 1994 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  0m07.0s/1m0s

running (0m08.0s), 50/50 VUs, 2201 complete and 0 interrupted iterations
default   [  13% ] 50 VUs  0m08.0s/1m0s

running (0m09.0s), 50/50 VUs, 2431 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  0m09.0s/1m0s

running (0m10.0s), 50/50 VUs, 2546 complete and 0 interrupted iterations
default   [  17% ] 50 VUs  0m10.0s/1m0s

running (0m11.0s), 50/50 VUs, 2661 complete and 0 interrupted iterations
default   [  18% ] 50 VUs  0m11.0s/1m0s

running (0m12.0s), 50/50 VUs, 2706 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  0m12.0s/1m0s

running (0m13.0s), 50/50 VUs, 2934 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  0m13.0s/1m0s

running (0m14.0s), 50/50 VUs, 3087 complete and 0 interrupted iterations
default   [  23% ] 50 VUs  0m14.0s/1m0s

running (0m15.0s), 50/50 VUs, 3332 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  0m15.0s/1m0s

running (0m16.0s), 50/50 VUs, 3362 complete and 0 interrupted iterations
default   [  27% ] 50 VUs  0m16.0s/1m0s

running (0m17.0s), 50/50 VUs, 3606 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  0m17.0s/1m0s

running (0m18.0s), 50/50 VUs, 3840 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  0m18.0s/1m0s

running (0m19.0s), 50/50 VUs, 4095 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  0m19.0s/1m0s

running (0m20.0s), 50/50 VUs, 4273 complete and 0 interrupted iterations
default   [  33% ] 50 VUs  0m20.0s/1m0s

running (0m21.0s), 50/50 VUs, 4437 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  0m21.0s/1m0s

running (0m22.0s), 50/50 VUs, 4631 complete and 0 interrupted iterations
default   [  37% ] 50 VUs  0m22.0s/1m0s

running (0m23.0s), 50/50 VUs, 4949 complete and 0 interrupted iterations
default   [  38% ] 50 VUs  0m23.0s/1m0s

running (0m24.0s), 50/50 VUs, 5279 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  0m24.0s/1m0s

running (0m25.0s), 50/50 VUs, 5592 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  0m25.0s/1m0s

running (0m26.0s), 50/50 VUs, 5857 complete and 0 interrupted iterations
default   [  43% ] 50 VUs  0m26.0s/1m0s

running (0m27.0s), 50/50 VUs, 6108 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  0m27.0s/1m0s

running (0m28.0s), 50/50 VUs, 6395 complete and 0 interrupted iterations
default   [  47% ] 50 VUs  0m28.0s/1m0s

running (0m29.0s), 50/50 VUs, 6684 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  0m29.0s/1m0s

running (0m30.0s), 50/50 VUs, 6982 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  0m30.0s/1m0s

running (0m31.0s), 50/50 VUs, 7189 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  0m31.0s/1m0s

running (0m32.0s), 50/50 VUs, 7510 complete and 0 interrupted iterations
default   [  53% ] 50 VUs  0m32.0s/1m0s

running (0m33.0s), 50/50 VUs, 7708 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  0m33.0s/1m0s

running (0m34.0s), 50/50 VUs, 7956 complete and 0 interrupted iterations
default   [  57% ] 50 VUs  0m34.0s/1m0s

running (0m35.0s), 50/50 VUs, 8240 complete and 0 interrupted iterations
default   [  58% ] 50 VUs  0m35.0s/1m0s

running (0m36.0s), 50/50 VUs, 8529 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  0m36.0s/1m0s

running (0m37.0s), 50/50 VUs, 8816 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  0m37.0s/1m0s

running (0m38.0s), 50/50 VUs, 9105 complete and 0 interrupted iterations
default   [  63% ] 50 VUs  0m38.0s/1m0s

running (0m39.0s), 50/50 VUs, 9388 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  0m39.0s/1m0s

running (0m40.0s), 50/50 VUs, 9648 complete and 0 interrupted iterations
default   [  67% ] 50 VUs  0m40.0s/1m0s

running (0m41.0s), 50/50 VUs, 9934 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  0m41.0s/1m0s

running (0m42.0s), 50/50 VUs, 10217 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  0m42.0s/1m0s

running (0m43.0s), 50/50 VUs, 10452 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  0m43.0s/1m0s

running (0m44.0s), 50/50 VUs, 10735 complete and 0 interrupted iterations
default   [  73% ] 50 VUs  0m44.0s/1m0s

running (0m45.0s), 50/50 VUs, 11006 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  0m45.0s/1m0s

running (0m46.0s), 50/50 VUs, 11279 complete and 0 interrupted iterations
default   [  77% ] 50 VUs  0m46.0s/1m0s

running (0m47.0s), 50/50 VUs, 11536 complete and 0 interrupted iterations
default   [  78% ] 50 VUs  0m47.0s/1m0s

running (0m48.0s), 50/50 VUs, 11824 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  0m48.0s/1m0s

running (0m49.0s), 50/50 VUs, 12049 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  0m49.0s/1m0s

running (0m50.0s), 50/50 VUs, 12231 complete and 0 interrupted iterations
default   [  83% ] 50 VUs  0m50.0s/1m0s

running (0m51.0s), 50/50 VUs, 12513 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  0m51.0s/1m0s

running (0m52.0s), 50/50 VUs, 12788 complete and 0 interrupted iterations
default   [  87% ] 50 VUs  0m52.0s/1m0s

running (0m53.0s), 50/50 VUs, 12991 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  0m53.0s/1m0s

running (0m54.0s), 50/50 VUs, 13272 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  0m54.0s/1m0s

running (0m55.0s), 50/50 VUs, 13547 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  0m55.0s/1m0s

running (0m56.0s), 50/50 VUs, 13804 complete and 0 interrupted iterations
default   [  93% ] 50 VUs  0m56.0s/1m0s

running (0m57.0s), 50/50 VUs, 14058 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  0m57.0s/1m0s

running (0m58.0s), 50/50 VUs, 14320 complete and 0 interrupted iterations
default   [  97% ] 50 VUs  0m58.0s/1m0s

running (0m59.0s), 50/50 VUs, 14614 complete and 0 interrupted iterations
default   [  98% ] 50 VUs  0m59.0s/1m0s

running (1m00.0s), 50/50 VUs, 14856 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  1m00.0s/1m0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    create_task_request_duration
    ✓ 'p(95)<2000' p(95)=1.31s

    health_request_duration
    ✓ 'p(95)<500' p(95)=164.9ms

    http_req_duration
    ✓ 'p(95)<2000' p(95)=423.14ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 16503   271.773387/s
    checks_succeeded...: 100.00% 16503 out of 16503
    checks_failed......: 0.00%   0 out of 16503

    ✓ health is UP
    ✓ create task status is 201

    CUSTOM
    create_task_request_duration...: avg=470.61ms min=12.36ms  med=353.04ms max=3.13s p(90)=1.02s    p(95)=1.31s   
    health_request_duration........: avg=50.7ms   min=568µs    med=25.68ms  max=1.74s p(90)=108.57ms p(95)=164.9ms 

    HTTP
    http_req_duration..............: avg=91.33ms  min=568µs    med=29.37ms  max=3.13s p(90)=196.61ms p(95)=423.14ms
      { expected_response:true }...: avg=91.33ms  min=568µs    med=29.37ms  max=3.13s p(90)=196.61ms p(95)=423.14ms
    http_req_failed................: 0.00%  0 out of 16503
    http_reqs......................: 16503  271.773387/s

    EXECUTION
    iteration_duration.............: avg=201.82ms min=100.75ms med=131.91ms max=3.24s p(90)=329.88ms p(95)=596.91ms
    iterations.....................: 14906  245.473799/s
    vus............................: 50     min=50         max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 7.7 MB 126 kB/s
    data_sent......................: 1.7 MB 28 kB/s



running (1m00.7s), 00/50 VUs, 14906 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  1m0s